---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.StartAndEndPointsTooClose
enum: Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus
source: html/c87dc425-1e13-40b9-df6d-08fde112210b.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus.StartAndEndPointsTooClose

Distance between adjacent points of path of travel (start, end and way points) is less than the value of [!:Autodesk::Revit::DB::Analysis::RouteAnalysisSettings::MinimumLength] .